
#include <stdio.h>
#include <stddef.h>

/**
 * 函数的作用是将参数值加 1。
 * 该函数没有返回值，因为传入的是地址，函数体内部对该地址包含的值的操作，会影响到函数外部，所以不需要返回值。
 */
void increment(int* p) {
    // 函数increment()的参数是一个整数指针 p。
    // * 函数体里面，*p 就表示指针 p 所指向的那个值。
    // * 对 *p 赋值，就表示改变指针所指向的那个地址里面的值。
    *p = *p + 1;
}

/**
 * @see https://wangdoc.com/clang/pointer
 *
 * C 语言的每一种数据，都是有类型（type）的，编译器必须知道数据的类型，才能操作数据。
 * 所谓“类型”，就是相似的数据所拥有的共同特征，那么一旦知道某个值的数据类型，就能知道该值的特征和操作方式。
 * 基本数据类型有三种：字符（char）、整数（int）和浮点数（float）。复杂的类型都是基于它们构建的。
 */
int main(){

    /**
        1. 简介

            指针是什么？首先，它是一个值，这个值代表一个内存地址，因此指针相当于指向某个内存地址的路标。

            字符`*`表示指针，通常跟在类型关键字的后面，表示指针指向的是什么类型的值。比如，char* 表示一个指向字符的指针，float* 表示一个指向 float 类型的值的指针。
            int* intPtr; // 示例声明了一个变量intPtr，它是一个指针，指向的内存地址存放的是一个整数。
            星号 * 可以放在变量名与类型关键字之间的任何地方。
            一般使用星号紧跟在类型关键字后面的写法（即int* intPtr;），因为这样可以体现，指针变量就是一个普通变量，只不过它的值是内存地址而已。
            
            一个指针指向的可能还是指针，这时就要用两个星号 ** 表示。如下：
     */
        printf("========================   Intro   ========================\n");
        // 一般写法有一个地方需要注意，如果同一行声明两个指针变量，那么需要写成下面这样。 
        int * foo , * bar;  // ✅
        int*  foo_, bar_ ;  // ❌ foo_ 是整数指针变量，而 bar_ 是整数变量，即 * 只对第一个变量生效。
        // 二级指针
        int** foo__;        // 表示变量 foo 是一个指针，指向的还是一个指针，第二个指针指向的则是一个整数。

    /**
        2. * 运算符

            `*`这个符号除了表示指针以外，还可以作为运算符，用来取出指针变量所指向的内存地址里面的值。
     */
        printf("========================Operator(*)========================\n");
        // 如函数 increment 一样，函数内部通过指针，将值传到外部，是 C 语言的常用方法。
        // 变量地址而不是变量值传入函数，还有一个好处。对于需要大量存储空间的大型变量，复制变量值传入函数，非常浪费时间和空间，不如传入指针来得高效。
        int value = 0;
        increment(&value);
    
    /**
        3. & 运算符

            `&`运算符用来取出一个变量所在的内存地址，所以也叫取址运算符。
            `&`运算符与`*`运算符互为逆运算，下面的表达式总是成立。
            int i = 5;
            if (i == *(&i))     // 正确
     */
        printf("========================Operator(&)========================\n");
        int x = 1;
        printf("x's address is %p\n", &x);                      // x's address is 0x7fffffffdd54
        increment(&x);
        printf("x's value after function called is %d\n", x);   // x's value after function called is 2

    /**
        4. 指针变量的初始化

            声明指针变量之后，编译器会为指针变量本身分配一个内存空间，但是这个内存空间里面的值是随机的，也就是说，指针变量指向的值是随机的。
            这时一定不能去读写指针变量指向的地址，因为那个地址是随机地址，很可能会导致严重后果。
            比如：int* p; *p = 1;   // ❌，因为 p 指向的那个地址是随机的，向这个随机地址里面写入 1，会导致意想不到的结果。
            ✅ 正确的做法是指针变量声明后，必须先对指针变量进行`初始化`，也就是让它指向一个分配好的地址，然后再进行读写。
            比如：int* p, i = 0; p = &i; // 第一步中的 p 申明给了随机地址，紧接着就赋值初始化了。

            为了防止读写未初始化的指针变量，可以养成习惯，将未初始化的指针变量设为 NULL [ #define NULL ((void *)0) ]。int* p = NULL;
            NULL 在 C 语言中是一个常量，表示地址为 0 的内存空间，这个地址是无法使用的，读写该地址会报错。

            在 C 语言中，`void *`被称为通用指针（Generic Pointer）或无类型指针。简单来说，它是一个可以指向任何类型数据的指针。有如下特点：
            1、兼容性极强：任何类型的指针（如 int *、char *、struct MyStruct *）都可以直接赋值给 void *，而无需进行强制类型转换。
            2、不可直接解引用：由于编译器不知道 void * 指向的数据具体是什么类型（是 4 字节的整数，还是 8 字节的双精度浮点数？），因此不能直接对 void * 进行解引用操作（即不能使用 *ptr）。
            3、必须强制转换：在使用它之前，必须先将其强制转换回原本的数据类型指针，然后才能读取或修改它指向的数据。
            内存管理函数：标准库中的 malloc、calloc 和 realloc 返回的都是 void *
     */
        printf("========================Pointer variable's initialize========================\n");
        int* p, i = 0; p = &i;
        int* p_ = NULL;
        // void *
        int  a = 10; char b = 'X';
        void *ptr = &a;                                             // void * 可以指向 int
        printf("point to int's  value is: %d\n", *(int  *)ptr);      // 必须先强转为 int* 再解引用
        ptr = &b;                                                   // 同一个 void * 也可以指向 char
        printf("point to char's value is: %c\n", *(char *)ptr);     // 必须先强转为 char* 再解引用

    /**
        5. 指针变量的运算

            指针本质上就是一个无符号整数，代表了内存地址。它可以进行运算，但是规则并不是整数运算的规则。

            （1）指针与整数值(单位)的加减运算：
                指针与整数值的运算，表示指针的移动多少个单位，每个单位的大小和指针所指的数据类型有关。数据类型占据多少个字节，每单位就移动多少个字节。

            （2）指针与指针的加法运算： ❌
                指针只能与整数值进行加减运算，两个指针进行加法是非法的。

            （3）指针与指针的减法：     ✅
                相同类型的指针允许进行减法运算，返回它们之间的距离，即相隔多少个数据单位。
                高位地址减去低位地址，返回的是正值；低位地址减去高位地址，返回的是负值。
                这时，减法返回的值属于`ptrdiff_t`类型，这是一个带符号的整数类型别名，具体类型根据系统不同而不同。这个类型的原型定义在头文件 stddef.h 里面。

            （4）指针与指针的比较运算：
                指针之间的比较运算，比较的是各自的内存地址哪一个更大，返回值是整数 1（true）或 0（false）。
     */
        printf("========================Pointer variable's calculate========================\n");
        // 示例中，j 是一个指针，指向内存地址0x1234。
        // 由于 0x1234 本身是整数类型（int），跟 j 的类型（short*）并不兼容，所以强制使用类型投射，将 0x1234 转成 short *。
        // 你可能以为 j + 1 等于 0x1235，但正确答案是 0x1236。
        // 原因是 j + 1 表示指针向内存地址的高位移动一个单位，而一个单位的 short 类型占据两个字节的宽度，所以相当于向高位移动两个字节。同样的，j - 1 得到的结果是 0x1232。
        short* j = (short*)0x1234;
        printf("(0x1234 + 1) short type address is: %p\n", j + 1);          // 0x1236
        printf("(0x1234 - 1) short type address is: %p\n", j - 1);          // 0x1232
        int* k = (int*)0x1234;
        printf("(0x1234 + 1) int   type address is: %p\n", k + 1);          // 0x1238
        printf("(0x1234 - 1) int   type address is: %p\n", k - 1);          // 0x1230

        // pointer - pointer
        short* j1 = (short*)0x1234, * j2 = (short*)0x123A;
        ptrdiff_t dist = j2 - j1;
        printf("\nfrom pointer1 to pointer2's distance is: %td\n", dist);   // 3

        // compare
        if( j2 > j1 ) 
            printf("\n0x123A address is greater than 0x1234\n");


    printf("\nCongratulations! you have learned the pointer of C language!\n");
    return 0;
}